IDEA Open Model
ISDModel.Geometry Property
 All geometrical entities of Detail
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public List<ReferenceElement> Geometry { get; set; }
Public Property Geometry As List(Of ReferenceElement)
	Get
	Set
public:
property List<ReferenceElement^>^ Geometry {
	List<ReferenceElement^>^ get ();
	void set (List<ReferenceElement^>^ value);
}
Property Value
Type: List<ReferenceElement>
See Also
Reference
ISDModel Class
IdeaRS.OpenModel.Detail Namespace